#define _CRT_SECURE_NO_WARNINGS
#include<stdio.h>
//迭代
//计算第N个斐波那契数
//int Fact(int n)//迭代
//{
//	int a = 1;
//	int b = 1;
//	int c = 0;
//	if (n <= 2)
//		return 1;
//	else
//		while (n > 2)
//		{
//			c = a + b;
//			a = b;
//			b = c;
//			n--;
//		}
//	return c;
//}
//
//
//int main()
//{
//	int n = 0;
//	scanf("%d",&n);
//	int r = Fact(n);
//	printf("%d", r);
//	return 0;
//}


//操作符详解
//进制

//int main()
//{
//	//int n = 123;
//	//printf("%d\n", n);//以十进制的方式打印的
//	//int n = 0123;
//	//printf("%d\n", n);//以八进制的方式打印的
//	int n = 0x2a;
//	printf("%d\n", n);//以十六进制的方式打印的
//	return 0;
//}

//原码补码反码
//int main()
//{
//	int n = 10;
//	//00000000 00000000 00001010--原码
//	//00000000 00000000 00001010--补码
//	//00000000 00000000 00001010--反码
//	int a = -10;
//	//10000000 00000000 00001010--原码
//	//11111111 11111111 11110101--反码
//	//11111111 11111111 11110101+1=11111111 11111111 11110110   补码
//	
//
//	
//	return 0;
//}



//int main()
//{
//	int a = 10;
//	//00000000 00000000 00001010--补码
//	int b = a << 1;//左移一位有乘二的效果 移动的是补码
//	printf("%d\n", a);//打印的是原码的值
//	printf("%d", b);
//	return 0;
//}

//int main()
//{
//	int a = -10;
//	10000000 00000000 00001010 原码
//	11111111 11111111 11110101 反码
//	111111111 11111111 1111011 -10的补码
//	111111111 11111111 1111011 移动后的补码 b储存的补码
//	10000000 00000000 00000101 移动后的原码 b储存的原码
//	int b = a >> 1;//即向右移一位有除以二的效果
//	printf("%d\n", a);
//	printf("%d\n", b);
//	return 0;
//}
//int main()
//{
//	int a = -4;
//	//10000000 00000000 00000100 原码
//	//11111111 11111111 11111011 反码
//	//11111111 11111111 11111100 补码
//	int b = 9;
//	//00000000 00000000 00001001 原码 补码 反码
//	
//
//	//11111111 11111111 11111100 补码
//	//00000000 00000000 00001001 原码 补码 反码
//	//00000000 00000000 00001000 c的补码 也是原码
//	// 
//	//	
//	int c = a & b;
//	printf("%d\n", c);
//	return 0;
//}

int main()
{
	////交换数字
	//int c = 0;
	//int a = 0;
	//int b = 0;
	//scanf("%d %d",&a, &b);
	//c = a;
	//a = b;
	//b = c;
	//printf("%d %d\n",a,b);
	/*int a = 0;
	int b = 0;
	scanf("%d %d",&a, &b);
	a = a ^ b;//异或可以适用于交换律
	b = a ^ b;
	a = a ^ b;
	printf("%d %d\n",a,b);*/
	int a = 0;
	int b = 0;
    scanf("%d %d", &a, &b);
	a = a + b;
	b = a - b;
	a = a - b;
	printf("%d %d\n", a, b);
	return 0;
}

//将一个整数的二进制中含一的个数打印出来
int main()//利用按位与&和移位>>统计二进制中1的个数
{
	int a = 0;

	return 0;
}







